restaurants = {
    "РюмкYY бар Народная Еда": {
        "link": "https://ryumkyybar.ru",
        "rating": "4.7",
        "type": "Бар, Паб, Ресторан, Кафе",
        "address": "ул. Народная, 1",
        "time": "пн-чт 12:00–00:00; пт,сб 12:00–02:00; вс 12:00–00:00",
        "metro": "Заельцовская",
        "phone": "+7 (993) 023-20-32"
    },
    "Аджикинежаль": {
        "link": "https://adjiki.ru",
        "rating": "4.9",
        "type": "Ресторан",
        "address": "ул. Красный проспект, 37",
        "time": "пн-чт 12:00–00:00; пт,сб 12:00–02:00; вс 12:00–00:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 227-09-21"
    },
    "Megobari": {
        "link": "https://megobari-nsk.ru",
        "rating": "4.6",
        "type": "Кафе, Банкетный зал, Ресторан",
        "address": "ул. Романова, 39",
        "time": "пн-чт 11:30–23:00; пт,сб 11:30–00:00; вс 11:30–23:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 311-04-24"
    },
    "Чучвара": {
        "link": "https://chuchvara.ru",
        "rating": "4.6",
        "type": "Ресторан",
        "address": "ул. Вокзальная магистраль, 16",
        "time": "ежедневно, 11:00–00:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 373-40-71"
    },
    "Чайхана Баранжар": {
        "link": "https://baranjar.ru",
        "rating": "4.8",
        "type": "Кафе, Ресторан",
        "address": "ул. Советская, 18",
        "time": "ежедневно, 12:00–00:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 209-09-02, +7 (383) 375-09-02"
    },
    "СибирьСибирь": {
        "link": "https://sibirsibir.ru/nsk",
        "rating": "4.9",
        "type": "Ресторан",
        "address": "ул. Дмитрия Шамшурина, 2",
        "time": "пн-чт 12:00–00:00; пт,сб 12:00–02:00; вс 12:00–00:00",
        "metro": "Площадь Гарина-Михайловского",
        "phone": "+7 (383) 209-12-09"
    },
    "Мятный карась": {
        "link": "https://mintkaras.ru",
        "rating": "4.4",
        "type": "Ресторан",
        "address": "ул. Красный проспект, 37",
        "time": "ежедневно, 12:00–00:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 227-16-15"
    },
    "Мимино": {
        "link": "https://vk.com/miminonsk",
        "rating": "4.4",
        "type": "Ресторан",
        "address": "ул. Октябрьская, 34",
        "time": "ежедневно, 13:00–23:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 380-64-34, +7 (951) 398-32-99"
    },
    "22 Twenty Two": {
        "link": "https://twentytwo.smartomato.ru",
        "rating": "4.4",
        "type": "Ресторан",
        "address": "ул. Красный проспект, 22",
        "time": "пн-пт 12:00–01:00; сб 12:00–03:00; вс 12:00–01:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 209-25-90"
    },
    "Сыроварня": {
        "link": "https://syrovarnya.com/novosibirsk",
        "rating": "5.0",
        "type": "Ресторан",
        "address": "ул. Ленина, 25",
        "time": "пн-чт 12:00–00:00; пт 12:00–02:00; сб 10:00–02:00; вс 10:00–00:00",
        "metro": "Площадь Гарина-Михайловского",
        "phone": "+7 (962) 825-61-58, +7 (383) 255-38-38"
    },
    "Хочу Пури": {
        "link": "https://hochupuri.com",
        "rating": "5.0",
        "type": "Ресторан",
        "address": "ул. Военная, 5",
        "time": "ежедневно, 10:00–23:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 205-30-65"
    },
    "Бродячая Собака": {
        "link": "https://sobaka.su",
        "rating": "4.8",
        "type": "Музыкальный клуб, Кафе, Бар, Паб",
        "address": "ул. Каменская, 32",
        "time": "пн-чт 16:00–01:00; пт,сб 16:00–03:00; вс 16:00–01:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 218-80-70"
    },
    "Рэсторани": {
        "link": "/",
        "rating": "4.6",
        "type": "Кафе, Ресторан",
        "address": "ул. Орджоникидзе, 21",
        "time": "пн-чт 12:00–23:00; пт,сб 12:00–00:00; вс 12:00–23:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 281-91-51, +7 (983) 002-91-51"
    },
    "Чайхона Курагадиван": {
        "link": "https://kuragadivan.ru",
        "rating": "4.5",
        "type": "Ресторан",
        "address": "ул. Военная, 5",
        "time": "ежедневно, 10:00–22:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 227-84-01, +7 (962) 839-40-33, +7 (962) 839-36-75"
    },
    "Пардон Май Френч": {
        "link": "https://pardonmyfrench.restoplace.ws",
        "rating": "4.7",
        "type": "Ресторан, Бар, Паб",
        "address": "ул. Коммунистическая, 34",
        "time": "пн-чт 16:00–01:00; пт,сб 16:00–02:00; вс 16:00–01:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 381-91-02"
    },
    "Намаскар Нихао": {
        "link": "/",
        "rating": "4.3",
        "type": "Кафе, Ресторан",
        "address": "ул. Дуси Ковальчук, 185",
        "time": "ежедневно, 12:00–00:00",
        "metro": "Заельцовская",
        "phone": "+7 (383) 236-15-77, +7 (905) 951-52-70"
    },
    "Паб-501": {
        "link": "https://pub501.ru",
        "rating": "4.7",
        "type": "Бар, Паб, Ресторан, Кафе",
        "address": "ул. Ленина, 20",
        "time": "ежедневно, 11:00–00:00",
        "metro": "Площадь Ленина",
        "phone": "+7 (383) 218-09-39, +7 (966) 501-15-01"
    },
    "Арагви": {
        "link": "https://aragvi.top",
        "rating": "4.8",
        "type": "Ресторан, Кафе",
        "address": "ул. Сибиряков-Гвардейцев, 26",
        "time": "ежедневно, 11:00–23:00",
        "metro": "Площадь Маркса, Студенческая, Речной вокзал",
        "phone": "+7 (383) 205-28-05"
    }
}

bars = {}
cafes = {}
favorites = {
    "Рестораны": restaurants,
    "Бары": bars,
    "Кафе": cafes
}
